# BOAZ_Data_preprocess_logics\regex_based_doc_parsing\pii_detector\DIct\address_dict.py\name_dict.py

sn1 = ['김', '이', '박', '최', '정', '강', '조', '윤', '장', '임',
    '한', '오', '서', '신', '권', '황', '안', '송', '류', '홍',
    '전', '고', '문', '양', '손', '배', '백', '허', '유', '남',
    '심', '노', '하', '곽', '성', '차', '주', '우', '구', '민',
    '류', '나', '진', '지', '엄', '채', '원', '천', '방', '공',
    '강', '현', '변', '양', '여', '노', '석', '추', '도', '소',
    '신', '위', '표', '명', '기', '왕', '금', '옥', '육',
    '인', '맹','갈','마','설','옹','피','함','편','원'] # 잘 쓰이는 성으로 추린 version

nn1 = [
    "광", "갑", "계", "가", "강", "건", "경", "규", "구", "군", "궁", "권", "근", "금", "기", "길", "김", "고", "관", "나", "난", "남", 
    "노", "누", "덕", "늘", "도", "다", "돈", "단", "동", "두", "득", "대", "라", "란", "람", "랑", "래",
    "련",  "레", "례", "로", "룩", "록", "료", "룡", "루", "류", "륵", "렬", "리", "린", "림", "마", "만", "말", "매", "맹",
    "면", "맑", "명", "모", "목", "묘", "무", "묵", "문", "미", "민", "박", "방", "배", "백", "범", "법", "벽", "별", "병", "보", "복",
    "본", "봉", "부", "분", "불", "붕", "빈", "사", "산", "삼", "상", "서", "성", "석", "선", "설", "섭", "세", "소", "솔", "송",
    "수", "숙", "순", "술", "슬", "승", "시", "식", "신", "심", "오", "영", "예", "옥", "온", "옹", "응", "아", "안", "애",
    "양", "어", "억", "얼", "언", "여", "연", "열", "왕", "완", "용", "우", "욱", "운", "웅", "원", "위", "유", "육", "윤", "율",
    "은", "을", "음", "의", "이", "익", "인", "일", "임", "자", "장", "재", "전", "점", "정", "제", "조", "종", "좌", "주", "준", "중",
    "지", "진", "차", "찬", "창", "채", "천", "철", "첩", "청", "체", "초", "총", "추", "최", "충", "춘", "태", "택", "특", "편", "평",
    "표", "필", "하", "학", "해", "향", "허", "헌", "혁", "현", "협", "형", "혜", "호", "홍", "화", "환", "황", "회", "효",
    "후", "훈", "훤", "휘", "희", "흥","치"
]

nn2 = ["광", "갑", "겨", "강", "경", "규", "궁",  "근", "길", "관", "난", "남",
    "노", "누", "덕", "늬", "늘", "돈", "단", "동", "득", "대", "란", "람", "랑", "래",
    "련", "령", "레", "례", "룩", "록", "룡", "루", "륵", "렬", "리", "린", "림", "마", "맹",
     "맑", "명", "목",  "무", "묵", "문", "미", "민", "박", "방", "배", "백", "범", "병", "보", "복",
    "본", "봉", "빈", "산", "삼", "성", "석", "선", "설", "섭", "솔", "송",
    "수", "숙", "순", "술", "슬", "승", "식", "신", "오", "영", "예", "옥", "온", "옹", "응", "아", "안", "애",
    "양", "억", "얼", "언", "연", "열",  "완", "용", "우", "욱", "운", "웅", "원", "유", "육", "윤",
 "음",  "익",  "일", "임", "재", "전", "점", "정", "제", "조", "종", "좌", "주", "준", "중",
     "진",  "찬", "창", "채", "천", "철", "첩", "체", "초", "최", "충", "춘", "태", "택", "특",
     "필", "학", "향", "허", "헌", "혁", "현", "협", "형", "혜", "호", "홍", "화", "환", "황", "회", "효",
    "후", "훈", "훤", "휘", "희", "흥","흠"]


# 조사 (은,지, 나 etc) 로 묶이는 애들은 이름 형식을 아예 정함
name = ["서하","유하","진하","준하","민하","예하","정하","태하","미령","혜령","민령","태령","희령","겨례","겨울","종면","준면","진면","형만","철만","경만","덕만","정만","병만","경류","기법","현권","희권","영권","민권","명권","형권","지구","태구","정구","새벽","준세","만세","온세","시라","아라","세라","예라","민서","지서","준서",'현서','예서','태서',"형서","이서","성모","현모","준표","정표","진표","영표","성표","민표", "현상","재상","민상","준상","기상","태상","태건","승건","민건","도건","우건","준건","재건","옥금","영금","애금","희금","정금","혜인","수인",'태인','지인',"가은", "나은", "다은", "라은", "하은", "수은", "시은", "예은", "지은", "서은", "혜은",
    "민은", "윤은", "채은", "유은", "진은", "세은", "도은", "재은","건한","래한","창한","근한",
    "태은", "주은", "성은", "선은",  "하나", "유나", "예나", 
     "미나", "루나", "다나", "윤나", "은나",
     "세나", "진나", "현나", "혜나", "리나", "연나", "정나", "태나", "민나",
       "서한", "태한", "민한", "준한", "영한", "재한", "승한", "지한", "우한",
     "성한", "동한", "건한", "규한","병한",
    "명한", "혁한","노을", "서지", "유지", "예지", "수지", "윤지", "은지", "세지", "현지", "혜지", "리지",
    "연지", "태지", "민지","승지", "우지", "유비","나비",  "루비",  "윤비", "은비", "세비","순자","옥자","명자","숙자","덕자","혜자","영자","경자",
       "서율", "하율", "지율", "예율", "민율", "진율", "다율",
    "채율", "지율", "소율", "라율", "은율", "선율", "희율", "다율","이도","현도","미도","영도","혁도","후이","제이","재이","세이","도이","현이","태이",'채이']