#BOAZ_Data_preprocess_logics\regex_based_doc_parsing\pii_detector\Dict\stopwords_dict.py


stopwords = ["기성대","조세라","조정하","나중임","하자란","편구배","유사성","위정환","권유하","정기준","심어진","기형일","여부안","전지구","안전성","문서일","채권단","금채무","구성","하여온","위인정","안정성","우수성","고장난","남성복","소유하","채권일","위금원","조정안","방안일","이후","조성한","채권단","이미본","심박수","현대화","유래한","도시철","전보배","배상제","위대우","전문화","이익제","하여진","장상황","정학회","인정보","배상제","공시송","전보배","장환경","원고보","공의무","인의무","현대미","구지방","정명령","우선협","손해전","배심원","방법원","공서양","정보제","송법제","차관리","명의무","공사완","윤리강","윤리경","소수주","이나마","인정하","구분하","우리나","손해배","고지령","고지의","유부남","고지한","방사성","변경전","차가운","장마철","성추문","원어음","신청일","최우선","서류일","편의성",
             "소지한","고령화","전산화","기산일","기수령","공고일","정해진","조회수","배나무","지하철","소제목","소재일","소유주","표현이","노하우",
             "성인용","구명정","남도록","한자명","변제일","도래한","원상태","장기화","주문만","우선은","채무관","마련하","인수대",
             "피보전","명명한","구조화","최종성","유동성","남겨진","피보전","위법성","주도록","기계화","구성원","노래방","한의원","공청회",
             "권고일","최종안","오후경","전구체","도전성","방사선","방법만","심사관","심사원","정해진","기재만","우회전","조현병","표명한","공정성",
             "채무일","엄청난","도래한","진정성","유리창","노조원","문화재","신고일","지구대","이전란","전기관","공익성","백화점","구체화","전자식","성전환",
             "방문단","최종면","조리용","이유란","고시중","도안화","한다면","지표면","정도만","소매점","인체용","명의만","변동한","원금란","지우지"
             ,"주도록","주택만","지정일","표현이","주기만","권리나","현금화","지명한","이자만","장기화","성명권","소지한","구성원","공정성","변경일","마치면",
             "노예제","조치일","이동식","위법성","주시면","고구마","고무제","우위성","채권양","주유하","지정하","공사명","방향제","양성한","나서지","지제동","변경허","추진하","유지한","여의동","남대문","설정하","석회석","노임단","유아용","명조체","표현","서가대","인지대","기사화","정정보","기록일","최고점","최하점","기준일","임대용","이윤","이체일","임원회","추정하","권고안","우선","공유하","지어진","옥수수","주소록","표시일","소득후","공제제","하주주","주식양","명의신","주주수","기산점",
            "하지만","구성한","지하수","양재천","구체성","전문성","육군성","방화문","주무관","유리문","도장용","방편일",
             "이사회","지자체","지중화","문제점","주채무","임명한","정회원","설명한","소수점","양수인","원미만","심평원",
             "지분란","소문만","서명한","소재한","공무원","위임용","위임장","양도한","금지한","기재한","변제기","위치만",
             "하여금", "하도록", "그러나", "정산금","조금만","임대료","원자재","손해금","피해금","고용주","기술상","유용성",
             "이사건","소제기",'위해서','위하여','공무상',"구상금","소송상","소득세","주차장","채석장","위원회","표시한"
             ,"서울대","한양대","지리산","주차타워","인도일","신고일","기도원","우동성","진지한","문구만","인체용","한방식","기본형","유효일","여성복","기성복",
             "홍보용","기화식","양산용","인지한","인도양","공유지","설명한","서명한","오전경","원어민","지구대"
             ,"위해성","편의점","성노예","위장관","여관방","방전복","고기만","명예나","도시화","도대체",'유치원',"지지대","전기용","주택용",
            "하수관","소수관","한남동","기부안","민영화","원고란","안경점","차단술","조영제","신경근","고정술","구하나","도덕관","공사중",
            "채권중","기재중","지분중","금원중","변경후","변경전","마무리","구조용","마루호","마무리","지도록","소나무","신사동","유해성","금고형","최우선","인화성","소유일","조정금","추모관","여부일","기명식","신청용","홍보관","피아노",
            "한의학","양의학","한동안","조례안","민주화","배구단","금강산","고시일","공시일","여인숙","갈수록","손수레","박람회","성매수",
            "현관문","고용안","기준설","위법하","주장하","소송경","유효성","명시하","명백하","공정화","지위남","배제하","우건설","방지하","지의무","전문점","변경하","유리하","기본수","신의성","금지조","민법학","공기관","기환송","위임관","방지하","표소송","주주대","진술하","주식회","한정하","도시철"
            "소수주","공동수","유사하","고지하","고이유","여부원","민법제","안정성","임사무","금지","원지방","장정보","현황문","설운영","인지정"]
       